In [50]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [51]:
%sql mysql+pymysql://root:kipsang@localhost:3306/md_water_services

Connecting and switching to connection 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [52]:
%%sql
SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
|    well_pollution_backup    |
+-----------------------------+

In [53]:
%%sql
SELECT
    REPLACE(employee_name, ' ','.') 
FROM
employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+---------------------------------+
| REPLACE(employee_name, ' ','.') |
+---------------------------------+
|           Amara.Jengo           |
|           Bello.Azibo           |
|           Bakari.Iniko          |
|          Malachi.Mavuso         |
|           Cheche.Buhle          |
|          Zuriel.Matembo         |
|           Deka.Osumare          |
|          Lalitha.Kaburi         |
|           Enitan.Zuri           |
|            Farai.Nia            |
+---------------------------------+
Truncated to displaylimit of 10.

In [54]:
%%sql
SELECT
LOWER(REPLACE(employee_name, ' ','.')) 
FROM
employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------------------------------+
| LOWER(REPLACE(employee_name, ' ','.')) |
+----------------------------------------+
|              amara.jengo               |
|              bello.azibo               |
|              bakari.iniko              |
|             malachi.mavuso             |
|              cheche.buhle              |
|             zuriel.matembo             |
|              deka.osumare              |
|             lalitha.kaburi             |
|              enitan.zuri               |
|               farai.nia                |
+----------------------------------------+
Truncated to displaylimit of 10.

In [55]:
%%sql
SELECT
CONCAT(
LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov') AS new_email 
FROM
employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+-------------------------------+
|           new_email           |
+-------------------------------+
|   amara.jengo@ndogowater.gov  |
|   bello.azibo@ndogowater.gov  |
|  bakari.iniko@ndogowater.gov  |
| malachi.mavuso@ndogowater.gov |
|  cheche.buhle@ndogowater.gov  |
| zuriel.matembo@ndogowater.gov |
|  deka.osumare@ndogowater.gov  |
| lalitha.kaburi@ndogowater.gov |
|   enitan.zuri@ndogowater.gov  |
|    farai.nia@ndogowater.gov   |
+-------------------------------+
Truncated to displaylimit of 10.

In [56]:
%%sql
UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name, ' ', '.')),

'@ndogowater.gov');

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [57]:
%%sql
SELECT
LENGTH(phone_number)
FROM
employee;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------------+
| LENGTH(phone_number) |
+----------------------+
|          12          |
|          12          |
|          12          |
|          12          |
|          12          |
|          12          |
|          12          |
|          12          |
|          12          |
|          12          |
+----------------------+
Truncated to displaylimit of 10.

In [58]:
%%sql
SELECT employee_name, phone_number, LENGTH(phone_number) AS length_before
FROM employee
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+----------------+--------------+---------------+
| employee_name  | phone_number | length_before |
+----------------+--------------+---------------+
|  Amara Jengo   | +99637993287 |       12      |
|  Bello Azibo   | +99643864786 |       12      |
|  Bakari Iniko  | +99222599041 |       12      |
| Malachi Mavuso | +99945849900 |       12      |
|  Cheche Buhle  | +99381679640 |       12      |
| Zuriel Matembo | +99034075111 |       12      |
|  Deka Osumare  | +99379364631 |       12      |
| Lalitha Kaburi | +99681623240 |       12      |
|  Enitan Zuri   | +99248509202 |       12      |
|   Farai Nia    | +99570082739 |       12      |
+----------------+--------------+---------------+
Truncated to displaylimit of 10.

In [59]:
%%sql
SELECT employee_name, TRIM(phone_number) AS cleaned_number
FROM employee
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+----------------+----------------+
| employee_name  | cleaned_number |
+----------------+----------------+
|  Amara Jengo   |  +99637993287  |
|  Bello Azibo   |  +99643864786  |
|  Bakari Iniko  |  +99222599041  |
| Malachi Mavuso |  +99945849900  |
|  Cheche Buhle  |  +99381679640  |
| Zuriel Matembo |  +99034075111  |
|  Deka Osumare  |  +99379364631  |
| Lalitha Kaburi |  +99681623240  |
|  Enitan Zuri   |  +99248509202  |
|   Farai Nia    |  +99570082739  |
+----------------+----------------+
Truncated to displaylimit of 10.

In [60]:
%%sql
UPDATE employee
SET phone_number = TRIM(phone_number);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [61]:
%%sql
SELECT town_name, COUNT(*) AS num_employees
FROM employee
GROUP BY town_name
ORDER BY num_employees DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------+---------------+
| town_name | num_employees |
+-----------+---------------+
|   Rural   |       29      |
|   Dahabu  |       6       |
|   Harare  |       5       |
|   Lusaka  |       4       |
|  Zanzibar |       4       |
|   Ilanga  |       3       |
|   Serowe  |       3       |
|  Kintampo |       1       |
|  Yaounde  |       1       |
+-----------+---------------+

In [62]:
%%sql
SELECT province_name, COUNT(*) AS num_locations
FROM location
GROUP BY province_name
ORDER BY num_locations DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+---------------+
| province_name | num_locations |
+---------------+---------------+
|    Kilimani   |      9510     |
|     Akatsi    |      8940     |
|     Sokoto    |      8220     |
|     Amanzi    |      6950     |
|    Hawassa    |      6030     |
+---------------+---------------+

In [63]:
%%sql
SELECT type_of_water_source, COUNT(*) AS num_sources
FROM water_source
GROUP BY type_of_water_source
ORDER BY num_sources DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------+
| type_of_water_source | num_sources |
+----------------------+-------------+
|         well         |    17383    |
|     tap_in_home      |     7265    |
|  tap_in_home_broken  |     5856    |
|      shared_tap      |     5767    |
|        river         |     3379    |
+----------------------+-------------+

In [64]:
%%sql
SELECT l.town_name, AVG(wq.subjective_quality_score) AS avg_quality
FROM visits v
JOIN location l ON v.location_id = l.location_id
JOIN water_quality wq ON v.record_id = wq.record_id
GROUP BY l.town_name
ORDER BY avg_quality DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+-----------+-------------+
| town_name | avg_quality |
+-----------+-------------+
|   Dahabu  |    6.6234   |
|   Pwani   |    5.9770   |
|  Abidjan  |    5.9265   |
|   Asmara  |    5.8353   |
|  Kintampo |    5.7480   |
|   Lusaka  |    5.6402   |
|   Bello   |    5.4256   |
|   Ilanga  |    5.3874   |
|   Amina   |    5.3298   |
|   Harare  |    5.2468   |
+-----------+-------------+
Truncated to displaylimit of 10.

In [65]:
%%sql
SELECT l.province_name, AVG(v.time_in_queue) AS avg_queue_time
FROM visits v
JOIN location l ON v.location_id = l.location_id
GROUP BY l.province_name
ORDER BY avg_queue_time DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+---------------+----------------+
| province_name | avg_queue_time |
+---------------+----------------+
|    Kilimani   |    67.1042     |
|     Akatsi    |    62.4109     |
|     Amanzi    |    57.5004     |
|     Sokoto    |    57.1354     |
|    Hawassa    |    55.8201     |
+---------------+----------------+

In [66]:
%%sql
SELECT name, year, wat_bas_r, wat_bas_u
FROM global_water_access
WHERE year = 2020
ORDER BY wat_bas_r ASC
LIMIT 20;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

20 rows affected.

+------------------------+------+-----------+-----------+
|          name          | year | wat_bas_r | wat_bas_u |
+------------------------+------+-----------+-----------+
|        Croatia         | 2020 |    None   |   100.0   |
|       Guadeloupe       | 2020 |    None   |    None   |
|  China, Hong Kong SAR  | 2020 |    None   |   100.0   |
|     American Samoa     | 2020 |    None   |    None   |
| British Virgin Islands | 2020 |    None   |    None   |
|         Italy          | 2020 |    None   |    None   |
|       Argentina        | 2020 |    None   |  99.7904  |
|   Brunei Darussalam    | 2020 |    None   |   99.65   |
|      Isle of Man       | 2020 |    None   |    None   |
|       Gibraltar        | 2020 |    None   |   100.0   |
+------------------------+------+-----------+-----------+
Truncated to displaylimit of 10.

In [67]:
%%sql
SELECT 
    town_name, 
    COUNT(*) AS record_count
FROM location
GROUP BY town_name
ORDER BY record_count DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+-----------+--------------+
| town_name | record_count |
+-----------+--------------+
|   Rural   |    23740     |
|   Harare  |     1650     |
|   Amina   |     1090     |
|   Lusaka  |     1070     |
|   Mrembo  |     990      |
|   Asmara  |     930      |
|   Dahabu  |     930      |
|  Kintampo |     780      |
|   Ilanga  |     780      |
|  Isiqalo  |     770      |
+-----------+--------------+
Truncated to displaylimit of 10.

In [68]:
%%sql
SELECT 
    v.assigned_employee_id,
    e.employee_name,
    COUNT(v.location_id) AS total_visits
FROM visits v
JOIN employee e 
    ON v.assigned_employee_id = e.assigned_employee_id
GROUP BY v.assigned_employee_id, e.employee_name
ORDER BY total_visits DESC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+--------------+
| assigned_employee_id | employee_name | total_visits |
+----------------------+---------------+--------------+
|          1           |  Bello Azibo  |     3708     |
|          30          |   Pili Zola   |     3676     |
|          34          |   Rudo Imani  |     3539     |
+----------------------+---------------+--------------+

In [69]:
%%sql
SELECT 
    employee_name,
    email,
    phone_number
FROM employee
WHERE assigned_employee_id IN (3, 7, 12);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------+-------------------------------+--------------+
| employee_name  |             email             | phone_number |
+----------------+-------------------------------+--------------+
| Malachi Mavuso | malachi.mavuso@ndogowater.gov | +99945849900 |
| Lalitha Kaburi | lalitha.kaburi@ndogowater.gov | +99681623240 |
|  Gamba Shani   |   gamba.shani@ndogowater.gov  | +99438283153 |
+----------------+-------------------------------+--------------+

In [70]:
%%sql
SELECT 
    employee_name,
    email,
    phone_number
FROM employee
WHERE assigned_employee_id IN (3, 7, 12);

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------+-------------------------------+--------------+
| employee_name  |             email             | phone_number |
+----------------+-------------------------------+--------------+
| Malachi Mavuso | malachi.mavuso@ndogowater.gov | +99945849900 |
| Lalitha Kaburi | lalitha.kaburi@ndogowater.gov | +99681623240 |
|  Gamba Shani   |   gamba.shani@ndogowater.gov  | +99438283153 |
+----------------+-------------------------------+--------------+

In [71]:
%%sql
SELECT 
    province_name,
    town_name,
    COUNT(*) AS records_per_town
FROM location
GROUP BY province_name, town_name
ORDER BY province_name ASC, records_per_town DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+------------------+
| province_name | town_name | records_per_town |
+---------------+-----------+------------------+
|     Akatsi    |   Rural   |       6290       |
|     Akatsi    |   Lusaka  |       1070       |
|     Akatsi    |   Harare  |       800        |
|     Akatsi    |  Kintampo |       780        |
|     Amanzi    |   Rural   |       3100       |
|     Amanzi    |   Asmara  |       930        |
|     Amanzi    |   Dahabu  |       930        |
|     Amanzi    |   Amina   |       670        |
|     Amanzi    |   Pwani   |       520        |
|     Amanzi    |  Abidjan  |       400        |
+---------------+-----------+------------------+
Truncated to displaylimit of 10.

In [72]:
%%sql
SELECT 
    location_type,
    COUNT(*) AS records_per_type
FROM location
GROUP BY location_type
ORDER BY records_per_type DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+------------------+
| location_type | records_per_type |
+---------------+------------------+
|     Rural     |      23740       |
|     Urban     |      15910       |
+---------------+------------------+

In [73]:
%%sql
SELECT 
    (23740 / (15910 + 23740)) * 100 AS rural_percentage,
    (15910 / (15910 + 23740)) * 100 AS urban_percentage;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------------+------------------+
| rural_percentage | urban_percentage |
+------------------+------------------+
|     59.8739      |     40.1261      |
+------------------+------------------+

In [74]:
%%sql
SELECT 
    SUM(number_of_people_served) AS total_people_surveyed
FROM water_source;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-----------------------+
| total_people_surveyed |
+-----------------------+
|        27628140       |
+-----------------------+

In [75]:
%%sql
SELECT 
    type_of_water_source,
    COUNT(*) AS num_sources
FROM water_source
GROUP BY type_of_water_source
ORDER BY num_sources DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------+
| type_of_water_source | num_sources |
+----------------------+-------------+
|         well         |    17383    |
|     tap_in_home      |     7265    |
|  tap_in_home_broken  |     5856    |
|      shared_tap      |     5767    |
|        river         |     3379    |
+----------------------+-------------+

In [76]:
%%sql
SELECT 
    type_of_water_source,
    AVG(number_of_people_served) AS avg_people_served
FROM water_source
GROUP BY type_of_water_source
ORDER BY avg_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------+
| type_of_water_source | avg_people_served |
+----------------------+-------------------+
|      shared_tap      |     2071.3147     |
|        river         |      699.1844     |
|  tap_in_home_broken  |      648.8593     |
|     tap_in_home      |      644.0303     |
|         well         |      278.5321     |
+----------------------+-------------------+

In [77]:
%%sql
SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS total_people_served
FROM water_source
GROUP BY type_of_water_source
ORDER BY total_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+---------------------+
| type_of_water_source | total_people_served |
+----------------------+---------------------+
|      shared_tap      |       11945272      |
|         well         |       4841724       |
|     tap_in_home      |       4678880       |
|  tap_in_home_broken  |       3799720       |
|        river         |       2362544       |
+----------------------+---------------------+

In [78]:
%%sql
SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS total_people_served
FROM water_source
GROUP BY type_of_water_source
ORDER BY total_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+---------------------+
| type_of_water_source | total_people_served |
+----------------------+---------------------+
|      shared_tap      |       11945272      |
|         well         |       4841724       |
|     tap_in_home      |       4678880       |
|  tap_in_home_broken  |       3799720       |
|        river         |       2362544       |
+----------------------+---------------------+

In [79]:
%%sql
SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS total_people_served,
    ROUND(SUM(number_of_people_served) / 27000000 * 100, 2) AS percentage_of_total
FROM water_source
GROUP BY type_of_water_source
ORDER BY percentage_of_total DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+---------------------+---------------------+
| type_of_water_source | total_people_served | percentage_of_total |
+----------------------+---------------------+---------------------+
|      shared_tap      |       11945272      |        44.24        |
|         well         |       4841724       |        17.93        |
|     tap_in_home      |       4678880       |        17.33        |
|  tap_in_home_broken  |       3799720       |        14.07        |
|        river         |       2362544       |         8.75        |
+----------------------+---------------------+---------------------+

In [80]:
%%sql
SELECT 
    type_of_water_source,
    source_id,
    number_of_people_served,
    RANK() OVER (PARTITION BY type_of_water_source 
                 ORDER BY number_of_people_served DESC) AS source_rank
FROM water_source
WHERE type_of_water_source IN ('shared_tap', 'tap_in_home_broken', 'well', 'river')
ORDER BY number_of_people_served DESC
LIMIT 20;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

20 rows affected.

+----------------------+--------------+-------------------------+-------------+
| type_of_water_source |  source_id   | number_of_people_served | source_rank |
+----------------------+--------------+-------------------------+-------------+
|      shared_tap      | HaRu19509224 |           3998          |      1      |
|      shared_tap      | AkRu05603224 |           3998          |      1      |
|      shared_tap      | AkRu04862224 |           3996          |      3      |
|      shared_tap      | KiHa22867224 |           3996          |      3      |
|      shared_tap      | AmAs10911224 |           3996          |      3      |
|      shared_tap      | KiZu31330224 |           3994          |      6      |
|      shared_tap      | HaRu19839224 |           3994          |      6      |
|      shared_tap      | KiZu31415224 |           3992          |      8      |
|      shared_tap      | KiRu28630224 |           3992          |      8      |
|      shared_tap      | KiRu26218224 |           3990          |      10     |
+----------------------+--------------+-------------------------+-------------+
Truncated to displaylimit of 10.

# RANK()

In [81]:
%%sql
SELECT 
    type_of_water_source,
    number_of_people_served,
    RANK() OVER (PARTITION BY type_of_water_source ORDER BY number_of_people_served DESC) AS rnk
FROM water_source
LIMIT 10;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

10 rows affected.

+----------------------+-------------------------+-----+
| type_of_water_source | number_of_people_served | rnk |
+----------------------+-------------------------+-----+
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
|        river         |           998           |  1  |
+----------------------+-------------------------+-----+
Truncated to displaylimit of 10.

In [82]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
DAYNAME(time_of_record),
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END AS Sunday
FROM
visits
WHERE
time_in_queue != 0;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

29642 rows affected.

+-------------+-------------------------+--------+
| hour_of_day | DAYNAME(time_of_record) | Sunday |
+-------------+-------------------------+--------+
|    09:00    |          Friday         |  None  |
|    09:00    |          Friday         |  None  |
|    10:00    |          Friday         |  None  |
|    10:00    |          Friday         |  None  |
|    11:00    |          Friday         |  None  |
|    11:00    |          Friday         |  None  |
|    12:00    |          Friday         |  None  |
|    12:00    |          Friday         |  None  |
|    13:00    |          Friday         |  None  |
|    13:00    |          Friday         |  None  |
+-------------+-------------------------+--------+
Truncated to displaylimit of 10.

In [83]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
-- Sunday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END
),0) AS Sunday,
-- Monday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday
-- Tuesday
-- Wednesday
FROM
visits
WHERE
time_in_queue != 0 -- this excludes other sources with 0 queue times
GROUP BY
hour_of_day
ORDER BY
hour_of_day;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+--------+--------+
| hour_of_day | Sunday | Monday |
+-------------+--------+--------+
|    06:00    |   79   |  190   |
|    07:00    |   82   |  186   |
|    08:00    |   86   |  183   |
|    09:00    |   84   |  127   |
|    10:00    |   83   |  119   |
|    11:00    |   78   |  115   |
|    12:00    |   78   |  115   |
|    13:00    |   81   |  122   |
|    14:00    |   83   |  127   |
|    15:00    |   83   |  126   |
+-------------+--------+--------+
Truncated to displaylimit of 10.

In [84]:
%%sql
SELECT 
    v.assigned_employee_id,
    e.employee_name,
    COUNT(v.location_id) AS total_visits
FROM visits v
JOIN employee e 
    ON v.assigned_employee_id = e.assigned_employee_id
GROUP BY v.assigned_employee_id, e.employee_name
ORDER BY total_visits ASC
LIMIT 3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+---------------+--------------+
| assigned_employee_id | employee_name | total_visits |
+----------------------+---------------+--------------+
|          20          |   Kunto Asha  |      15      |
|          22          |  Lesedi Kofi  |     143      |
|          44          | Wambui Jabali |     218      |
+----------------------+---------------+--------------+

In [85]:
%%sql
SELECT 
    location_id,
    time_in_queue,
    AVG(time_in_queue) OVER (PARTITION BY location_id ORDER BY visit_count) AS total_avg_queue_time
FROM 
    visits
WHERE 
visit_count > 1 -- Only shared taps were visited > 1
ORDER BY 
    location_id, time_of_record;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

20496 rows affected.

+-------------+---------------+----------------------+
| location_id | time_in_queue | total_avg_queue_time |
+-------------+---------------+----------------------+
|  AkHa00036  |      113      |       113.0000       |
|  AkHa00036  |      229      |       171.0000       |
|  AkHa00036  |      400      |       247.3333       |
|  AkHa00036  |      120      |       215.5000       |
|  AkHa00036  |      185      |       209.4000       |
|  AkHa00036  |      158      |       200.8333       |
|  AkHa00036  |      226      |       204.4286       |
|  AkHa00090  |       50      |       50.0000        |
|  AkHa00090  |       63      |       56.5000        |
|  AkHa00090  |       12      |       41.6667        |
+-------------+---------------+----------------------+
Truncated to displaylimit of 10.

In [86]:
%%sql
    SELECT
TRIM('33 Angelique Kidjo Avenue  ');

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------------------+
| TRIM('33 Angelique Kidjo Avenue  ') |
+-------------------------------------+
|      33 Angelique Kidjo Avenue      |
+-------------------------------------+

In [88]:
%%sql
SELECT
    COUNT(*) AS employees_in_harare_kilimani
FROM
    employee
WHERE
    town_name = 'Harare' AND province_name = 'Kilimani';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+------------------------------+
| employees_in_harare_kilimani |
+------------------------------+
|              2               |
+------------------------------+

In [90]:
%%sql
SELECT
    ROUND(AVG(number_of_people_served), 0) AS Average_People_Per_Well
FROM
    water_source
WHERE
    type_of_water_source = 'well';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------------------+
| Average_People_Per_Well |
+-------------------------+
|           279           |
+-------------------------+